<template>
  <div class="contract1">
    <div class="ct_detai">
      <p class="agreementNo" v-if="$route.query.cNumber">
        协议编号：{{$route.query.cNumber}}
      </p>
      <p>甲方：广州闪购软件服务有限公司	（以下简称“甲方”或者“闪购”）</p>
      <p>地址：广州市天河区珠江东路32号利通广场21层</p>
      <p><span style="display: inline-block;width: 200px;">授权联系人：余绍雄 </span><span style="display: inline-block;width: 200px;">联系电话：18988918912</span></p>
      <br />
      <p>乙方：{{contractData.name}}（以下简称“乙方”）</p>
      <p>地址：{{contractData.address}} </p>
       <p><span style="display: inline-block;width: 200px;">授权联系人：{{contractData.legalPerson}} </span><span style="display: inline-block;width: 200px;">联系电话：{{contractData.contactTel}}</span></p>
      <br />
      <p>一、鉴于条款</p>
      <p>甲方专注于移动物联网的研发和应用，致力于打造全球引领未来的国家级移动物联网平台，建立诚信、安全、便捷的电子商务消费环境。闪购通过具有国家发明专利技术的“真知 码”，以“真知码+物联网+云计算”的核心科技，通过商品和服务联接消费者、商家，构 建万物联网生态系统，实现消费者、商家和谐相依，共同发展，是使用真知码扫码购物的唯 一销售平台。</p>
      <p>甲乙双方经过友好、平等协商，根据《中华人民共和国合同法》和其他相关法律法规的 规定，就甲方为乙方提供“闪购真品”平台服务的有关事项达成如下协议。</p>
      <br/>
      <p>二、“闪购真品”平台服务</p>
      <p>2.1 真品溯源：以真知码品质保障体系为技术支撑，通过对商品赋码来实现溯源、认证和管 理，保证真品随行。</p>
      <p>2.2 手机商城：定位中高端用户的真品手机购物平台，让用户轻松享受随时随地，手机购物 的乐趣。</p>
      <p>2.3 扫码购物：以产品、包装、标签、说明书、广告介质等直接赋码为销售渠道，赋码后即 可实现多维度的“自我销售”，对商家表现为以物售物、无处不在的终端卖场。</p>
      <p>2.4 图文广告：把真知码变成图文广告和资讯发布平台，实现随时随地传播图文信息。</p>
      <p>2.5 视频广告：把真知码变成视频广告和资讯发布平台，实现随时随地传播视频广告和资讯。</p>
      <br>
      <p>三、服务期限、联系人</p>
      <p>3.1 本协议自双方签字盖章之日起成立，合同期限为一年；</p>
      <p>3.2  甲乙双方指定专门的接口人与对方进行履行本协议的相关事宜：</p>
      <p>
        <span class="info-person">甲方业务接口人（指定联系人）：<span class="money">余绍雄</span>   ；电话：<span class="money">18988918912</span>； </span>
        
      </p>
      <p><span class="info-tele">电子邮箱：<span class="money">yusx@iflashbuy.com。</span></span></p>
      <p>
        <span class="info-person">乙方业务接口人（指定联系人）<span class="money">{{contractData.legalPerson}}</span>；电话：<span class="money">{{contractData.contactTel}}</span>； </span>     	
      </p>
      <p> <span class="info-tele">电子邮箱： <span class="money">&nbsp;{{contractData.contactEmail}}</span>。</span> </p>
      <p>3.3 上述联系人、联系方式如进行变更，双方需在第一时间以书面形式方式通知对方；</p>
      <p>3.4 协议届满前 20 个工作日内双方就续约事宜进行商谈；在协议期限届满时，仍未达成一致 意见的，本协议终止。</p>
      <br>
      <p>四、服务费用</p>
      <p>
        4.1 甲方向乙方提供“闪购真品”平台服务，为确保进驻“闪购真品”平台的商品品质及客 户服务，乙方向甲方支付平台技术服务年费、保证金、交易佣金及赋码服务费等。
      </p>
      <p>
        4.1.1 甲方按平台标准向乙方收取的费用为：
      </p>
      <p>（1）平台技术服务年费 <span class="money" >￥{{contractData.serviceCharge}}</span>（大写：<span class="money">&nbsp;{{contractData.serviceChargeCode}}</span>人民币 	）</p>
      <p>（2）保证金<span class="money">￥{{contractData.cashDeposit}}</span>（大写：<span class="money">&nbsp;{{contractData.cashDepositCode}}</span>人民币 	）;</p>
      <p>（3）佣金标准为交易额的 <span>{{contractData.commission}}</span>。</p>
      <p>（4）真知码溯源认证服务费￥100 万元（大写：人民币壹佰万元整），免费提供。</p>
      <p>（5）电子码免费，实物标签按照“真知码”收费标准收取费用，相关赋码设备等具体费用见 《闪购真品平台 2018 年报价体系》。</p>
      <p>
        4.1.2  乙方须在本协议签订后 5 个工作日内一次性将协议款项（即：平台技术服务费年费及保证金），合计金额￥<span>{{contractData.totalMoney}}</span><!--（大写：_____人民币 	）-->汇入甲方指定账户。

        <table class="info-table">
          <tr>
            <td rowspan="3" width="140">甲方指定账户：</td>
            <td  width="80">开户银行</td>
            <td>中国建设银行股份有限公司广州广花三路支行</td>
          </tr>
          <tr>
            <td  width="80">户名</td>
            <td>广州闪购软件服务有限公司</td>
          </tr>
          <tr>
            <td  width="80">帐号</td>
            <td>4405&nbsp;&nbsp;0149&nbsp;&nbsp;1103&nbsp;&nbsp;000&nbsp;&nbsp;000&nbsp;&nbsp;29</td>
          </tr>
        </table>
        <p>乙方付清上述款项后，本协议正式生效。</p>
        <p>除甲方原因外，平台技术服务年费、交易佣金、赋码服务费不因合同提前解除或终止履 行等原因而退还。</p>
      </p>
      <p>4.1.3 甲方在双方合同终止后的 30 个工作日内向乙方一次性返还保证金本金。如乙方交纳保 证金即承诺授权甲方先行赔付权。</p>
        <table class="info-table">
          <tr>
            <td rowspan="3" width="140">乙方指定账户：</td>
            <td width="80">开户银行</td>
            <td>{{contractData.depositBank}}</td>
          </tr>
          <tr>
            <td width="80">户名</td>
            <td>{{contractData.accountName}}</td>
          </tr>
          <tr>
            <td width="80">帐号</td>
            <td>{{contractData.bankAccount}}</td>
          </tr>
        </table>      
      <br>
      <p>4.1.3 货款</p>
      <p>（1）消费者通过“闪购真品”平台购买乙方出售的商品，在交易过程中第三方（如银联、 银行、物流公司代收货款、第三方支付公司等）收取的费用均由乙方承担。</p>
      <p>（2）甲方于每月第五个工作日前将上月销售对账单给乙方，乙方在收到对账单的 5 个工作 日内未提出书面异议的，视为无异议。甲乙双方于接下来的 5 个工作日内进行佣金及货款结 算。</p>
      <p>
        五、甲方的权利和义务
      </p>
      <p>
        5.1 甲方必须依照相关法律、法规和本协议约定向乙方提供“闪购真品”平台服务。
      </p>
      <p>
        5.2 甲方需审核乙方的企业资质，若乙方资质不完全，甲方有权延迟或暂停本协议内容。
      </p>
      <p>
        5.3 甲方保留对“闪购真品”平台不断调整及优化的权利，对“闪购真品”平台升级更新过 程中产生的板块调整、栏目变化、功能优化等的改变，甲方将会进行公示，并拥有最终解释 权。
      </p>
      <p>
      	5.4 甲方有权针对乙方的违规运营按规定的条例进行处理，情节严重的则可以扣除乙方保证 金甚至无条件关闭乙方店铺。详细内容以甲方发布的相关运营规则制度为准。
      </p>
      <p>
        <br> 六、乙方的权利和义务
      </p>
      <p>
       6.1 乙方经营资质
      </p>
      <p>
    （1）乙方保证其为依中国法律登记、注册的经营机构，具有签订本协议的权利能力及行为 能力，并具有经营本协议项下商品或服务的合法经营资质。<br />
    （2）在签订本协议时，乙方应同时提供加盖乙方公章的合法有效证明文件作为本合同附件， 证明其在甲方“闪购真品”平台销售商品属合法经营，包括但不限于以下资料：<br />
	 &nbsp;&nbsp;&nbsp;&nbsp;a) 主体资格证书：包括工商营业执照、税务登记证（国税、地税）、组织机构代码证；<br>
   &nbsp;&nbsp;&nbsp;&nbsp;b) 授权书：包括但不限于商标授权、品牌授权、专利授权、销售授权等，该等材料须提 供正本或副本复印件；<br>
   &nbsp;&nbsp;&nbsp;&nbsp;c) 特定行业资质：指乙方经营的商品根据国家法律、法规、规章、规范性文件等需要具 备的行业资质证书。<br>
     （3）乙方提供给甲方的上述证件如有更新，乙方应于更新后起 1 个月内提供给甲方。如乙 方提供虚假、失效文件或未及时提供更新后的文件，甲方有权随时解除本协议及全部附件， 立即注销该乙方账户，乙方应承担由此产生的法律责任。  <br />       
      </p>
      <p>
       6.2 乙方商品品质保证
      </p>
      <p>
     （1）乙方承诺通过“闪购真品”平台所销售及展示的全部商品均符合国家法律法规及政府 相关标准规定，确保“闪购真品”平台上的商品安全可信；<br>
	（2）乙方通过“闪购真品”平台销售的商品，按国家的售后三包政策向消费者提供退换货服务，乙方所提供的售后服务不得低于“7 天无理由退换货”（法律法规另有规定除外）。
      </p>
      <p>
        6.3 乙方服务品质保证
      </p>  
      <p>
			（1）乙方需承诺在使用“闪购真品”平台服务过程中实施的所有行为均遵守国家法律、法 规等规范性文件及“闪购真品”平台各项规则的规定和要求，不违背社会公共利益或公共道 德，不损害他人的合法权益。<br />
			（2）乙方如果违反前述承诺，产生相关法律后果，乙方均应以自己的名义独立承担所有的 法律责任，并确保甲方免于因此产生任何损失。
      </p>
      <p>6.4 乙方承诺甲方为“闪购真品”平台服务供应商，乙方进驻“闪购真品”平台的所有商品， 不得高于其他电商平台上该商品的销售价格。</p>
      <p>
        6.5 乙方应在其产品包装上直接印刷真知码商标标识或者将真知码商标标识印刷并粘贴在 产品包装上，真知码商标标识印刷、粘贴等产生的费用由乙方承担。
      </p>
      <p>6.6 甲方对于真知码商标标识享有完整知识产权（包括但不限于商标权、专利权、著作权等）， 真知码商标标识仅限乙方在其商品上使用，不可转借或转卖给其它第三方。</p>
      <p>
      	6.7 乙方须组建专门队伍负责商家入驻，负责产品赋码、商家店铺装饰、商品上架，图片文 字美化处理、订单处理、物流配送等相关工作。
      </p>
      <p>
      	6.8 乙方须遵守甲方制订的“闪购真品”平台运营规则制度，在既定的平台规则制度下开展 运营推广活动，如不能积极参与甲方开展的平台活动或出现其他违规，将按“闪购真品”平 台运营规则进行处理。
      </p>
      <br>
      <p>
        七、协议的变更、解除与终止
      </p>
      <p>
        7.1 有下列情形之一的，甲方可以暂停向乙方提供本协议规定的部分或全部服务，直至解除 本协议，乙方对甲方因此而造成的损失进行赔偿（其中的损失包括但不限于直接损失、间接 损失、相关的调查费用、相关的诉讼费用以及公证费用）应给予赔偿；
        <br> 7.1.1 乙方提供的产品信息等不真实性，造成误导消费者的；
        <br> 7.1.2 乙方违反国家相关法律、法规，利用甲方提供的服务进行非法活动，侵犯他人合法权益的；
        <br> 7.1.3 乙方在使用甲方服务过程中，严重违反商业道德及信誉，给甲方公司及服务形象造成 严重损害的；
        <br> 7.1.4 乙方不能提供给甲方相关的具有经营本协议项下商品或服务的合法经营资质的；
        <br> 7.2 乙方所提供给甲方的指定联系人、联系方式进行了变更但未及时通知甲方，导致合同 履行障碍的；
        <br> 7.3 甲方未按本协议约定标准向乙方提供“闪购真品”平台服务，造成乙方损失的，乙方可以解除本协议。 
      </p>
      <br>
      <p>
      八、违约责任
      </p>
      <p>
        8.1 乙方在未征得甲方同意的情况下，擅自将甲方提供的服务转让给第三方所引起的一切法律后果，均由乙方承担，因此给甲方造成的损失（其中的损失包括但不限于直接损失、间接 损失、相关的调查费用、相关的诉讼费用以及公证费用）应给予赔偿；
        <br> 8.2 除本协议约定或法定情形外，任何一方不得擅自解除或终止本协议，否则，违约方应按 本协议约定保证金的百分之五十向对方承担违约责任，并就该违约行为所造成的损失向对方 承担赔偿责任；
      	<br />8.3 如乙方违反第六条约定的义务之一，根据违约情形，乙方同意甲方不退还保证金或支付 与保证金等值的金额作为违约金给予甲方，如违约金不足以弥补甲方损失的，乙方需补足。 
      </p>
      <br>
      <p>九、免责条款</p>
      <p>
      因不可抗力（指不能预见、不能避免，并不能克服的客观情况，例如：地震、台风、战争、火灾、水灾、罢工、黑客攻击、网络故障等）致使一方不能履行或延迟履行全部或部 分义务的，则可根据不可抗力影响程度部分或全部免除责任，法律另有规定除外，但一方迟 延履行后发生不可抗力的不免除责任。
      </p>
      <p>
        <br> 十、其它规定
      </p>
      <p>
        10.1  因本协议引起的或与本协议有关的任何争议，双方应友好协商解决。如协商无法解决， 则应向甲方所在地人民法院提起诉讼。
        <br>10.2 甲乙双方保证本协议内所有相关信息不被泄露（包括但不限于合同条款、价格、平台 技术服务年费、佣金等）以及在合作过程中所知晓的对方商业秘密。
        <br> 10.3 如果因为前款所称的行为造成对方的损失，根据本协议要求违约方承担违约责任，或 者根据国家相关的法律法规要求违约方承担给对方所造成的损失，包括但不限于直接损失、 客户索赔损失，因此产生的诉讼费、律师费、差旅费、相关的调查费用等。
        <br> 10.4 双方对保密资料享有知识产权，披露方将保密资料交付对方，并不构成披露方向对方 及其代表转让或许可使用商业秘密、商标、专利、技术秘密及其它知识产权权益。
        <br> 10.5 本协议正本壹式贰份，甲乙双方各持壹份，每份正本均具有同等法律效力。
      </p>
      <br>
      <p>
        （以下无正文） </p>
      <div class="signContent">
        <div class="signContent-item">
          <p>
            甲方（盖章）：广州闪购软件服务有限公司
          </p>
          <p>法定代表人/其授权代表：余绍雄</p>
          <p>签字日期：</p>
        </div>
        <div class="signContent-item">
          <p>
            乙方（盖章）：
          </p>
          <p>法定代表人/其授权代表：{{contractData.legalPerson}}</p>
          <p>签字日期：</p>
        </div>
      </div>
    </div>
  </div>
</template>
<script>
  export default {
    props: {
      contractData: {
        default: {},
        type: Object
      }
    }
  }

</script>
<style>
	.contract1{
		padding: 30px;
	}
	
	.ct_detai{
	font-size: 14px;
	color: #333333;		
		}
	.ct_detai table{
		min-width: 513px;
		width: auto;
		border: 1px solid gainsboro;
	}
	.ct_detai table td{
		border: 1px solid gainsboro;
		padding: 6px;
	}
		.ct_detai table th{
		border: 1px solid gainsboro;
	}
	.money{
		display: inline-block;
		min-width: 100px;
		width: auto;
		padding-left: 10px;
		padding-right: 10px;
		border-bottom: 1px solid #333333;
	}
</style>